{
  "mappings": [
    {
      "keywords": ["goodness", "faithful", "never fail", "faithfulness"],
      "verses": ["Psalm 23:6", "Lamentations 3:22-23", "Psalm 100:5", "Psalm 107:1"],
      "themes": ["God's faithfulness", "His goodness", "Steadfast love"],
      "callToWorship": "Let us come before the Lord with thanksgiving, for His goodness endures forever. His mercies are new every morning, great is His faithfulness!",
      "prayerPoints": "Thank God for His faithful presence in your life. Remember His past goodness and trust Him for the future.",
      "benediction": "May the goodness of the Lord follow you all the days of your life, and may you dwell in His house forever."
    },
    {
      "keywords": ["holy", "worthy", "glory", "majesty", "exalt"],
      "verses": ["Isaiah 6:3", "Revelation 4:8", "Psalm 29:2", "Psalm 96:9"],
      "themes": ["Holiness of God", "Worship", "Reverence"],
      "callToWorship": "Holy, Holy, Holy is the Lord God Almighty, who was and is and is to come! Let us worship Him in the splendor of His holiness.",
      "prayerPoints": "Acknowledge God's holiness and majesty. Confess any areas where you have fallen short of His glory.",
      "benediction": "May you walk in holiness before the Lord, reflecting His glory in all that you do."
    },
    {
      "keywords": ["praise", "hallelujah", "alleluia", "celebrate", "rejoice"],
      "verses": ["Psalm 150:1-6", "Psalm 100:1-5", "Philippians 4:4", "Psalm 34:1"],
      "themes": ["Praise", "Celebration", "Joy in the Lord"],
      "callToWorship": "Let everything that has breath praise the Lord! Enter His gates with thanksgiving and His courts with praise.",
      "prayerPoints": "Offer praise to God for who He is. Let your heart overflow with gratitude and joy.",
      "benediction": "May your life be a continuous song of praise to the One who is worthy of all honor and glory."
    },
    {
      "keywords": ["love", "grace", "mercy", "compassion", "kindness"],
      "verses": ["John 3:16", "Romans 8:38-39", "Ephesians 2:4-5", "Psalm 136:1"],
      "themes": ["God's love", "Amazing grace", "Divine mercy"],
      "callToWorship": "For God so loved the world that He gave His only Son. Let us respond to His amazing love with hearts of worship.",
      "prayerPoints": "Thank God for His unconditional love. Pray for the ability to share His love with others.",
      "benediction": "May the love of Christ dwell richly in your hearts, and may you be rooted and grounded in His eternal love."
    },
    {
      "keywords": ["cross", "blood", "calvary", "crucified", "sacrifice", "lamb"],
      "verses": ["Isaiah 53:5", "1 Peter 2:24", "Hebrews 9:22", "John 1:29"],
      "themes": ["The Cross", "Redemption", "Sacrifice of Christ"],
      "callToWorship": "Behold the Lamb of God who takes away the sin of the world. Let us remember His sacrifice with grateful hearts.",
      "prayerPoints": "Reflect on the price Christ paid for your salvation. Thank Him for His willing sacrifice.",
      "benediction": "May the message of the cross be the power of God in your life, bringing salvation and transformation."
    },
    {
      "keywords": ["risen", "resurrection", "alive", "victory", "overcome", "triumph"],
      "verses": ["1 Corinthians 15:55-57", "Romans 6:9", "Matthew 28:6", "Revelation 1:18"],
      "themes": ["Resurrection", "Victory over death", "Living hope"],
      "callToWorship": "He is risen! Death has been conquered and the grave has lost its sting. Let us celebrate the risen King!",
      "prayerPoints": "Thank God for the power of resurrection. Pray for new life in areas that feel dead or hopeless.",
      "benediction": "May the resurrection power of Christ fill you with hope and strength for every challenge you face."
    },
    {
      "keywords": ["spirit", "breath", "fire", "pentecost", "wind", "holy ghost"],
      "verses": ["Acts 2:1-4", "John 14:26", "Romans 8:26", "Galatians 5:22-23"],
      "themes": ["Holy Spirit", "Divine empowerment", "Spiritual gifts"],
      "callToWorship": "Come, Holy Spirit, fill this place with Your presence. Breathe on us and renew us with Your fire.",
      "prayerPoints": "Ask for a fresh filling of the Holy Spirit. Pray for guidance, wisdom, and spiritual fruit.",
      "benediction": "May the Holy Spirit be your constant companion, leading you into all truth and empowering you for service."
    },
    {
      "keywords": ["king", "throne", "reign", "kingdom", "sovereign", "lord"],
      "verses": ["Revelation 19:16", "Psalm 47:7-8", "Daniel 4:34-35", "1 Timothy 6:15"],
      "themes": ["Kingship of Christ", "God's sovereignty", "His reign"],
      "callToWorship": "The Lord reigns! Let the earth rejoice. Crown Him Lord of all and bow before His throne.",
      "prayerPoints": "Surrender every area of your life to His lordship. Acknowledge His authority over all things.",
      "benediction": "May you live under the gracious rule of King Jesus, experiencing the peace and joy of His kingdom."
    },
    {
      "keywords": ["healer", "heal", "healing", "restore", "whole", "touch"],
      "verses": ["Jeremiah 17:14", "Isaiah 53:5", "James 5:14-15", "Psalm 103:2-3"],
      "themes": ["Divine healing", "Restoration", "God our healer"],
      "callToWorship": "The Lord who heals is among us. Bring your brokenness and trust in His restoring power.",
      "prayerPoints": "Pray for healing - physical, emotional, and spiritual. Trust God as Jehovah Rapha, the Lord who heals.",
      "benediction": "May the healing touch of Jesus bring wholeness to every area of your life."
    },
    {
      "keywords": ["peace", "rest", "still", "quiet", "calm", "refuge"],
      "verses": ["John 14:27", "Philippians 4:6-7", "Psalm 46:10", "Isaiah 26:3"],
      "themes": ["Peace of God", "Rest in Him", "Divine comfort"],
      "callToWorship": "Be still and know that He is God. Let the peace that surpasses understanding guard your hearts.",
      "prayerPoints": "Release your anxieties to God. Pray for His peace to reign in situations that cause worry.",
      "benediction": "May the peace of God which transcends all understanding guard your heart and mind in Christ Jesus."
    },
    {
      "keywords": ["strength", "strong", "power", "mighty", "fortress", "rock"],
      "verses": ["Isaiah 40:31", "Psalm 18:2", "Ephesians 6:10", "2 Corinthians 12:9"],
      "themes": ["God our strength", "Divine power", "Refuge in Him"],
      "callToWorship": "The Lord is our strength and our shield. In Him we find our fortress and our deliverer.",
      "prayerPoints": "Ask God for strength in your weakness. Trust in His power rather than your own ability.",
      "benediction": "May you go forth in the strength of the Lord, finding Him to be your rock and fortress."
    },
    {
      "keywords": ["shepherd", "sheep", "pasture", "lead", "guide", "valley"],
      "verses": ["Psalm 23:1-6", "John 10:11", "Isaiah 40:11", "John 10:27-28"],
      "themes": ["The Good Shepherd", "Divine guidance", "His care for us"],
      "callToWorship": "The Lord is our Shepherd; we shall not want. He leads us beside still waters and restores our souls.",
      "prayerPoints": "Thank God for His shepherding care. Ask Him to lead you in paths of righteousness.",
      "benediction": "May the Good Shepherd lead you through every valley, providing all you need and guiding you home."
    },
    {
      "keywords": ["light", "shine", "darkness", "dawn", "morning", "sun"],
      "verses": ["John 8:12", "Psalm 27:1", "Matthew 5:14-16", "1 John 1:5"],
      "themes": ["Christ the Light", "Walking in light", "Overcoming darkness"],
      "callToWorship": "Jesus is the Light of the world. Whoever follows Him will never walk in darkness but have the light of life.",
      "prayerPoints": "Ask God to reveal any darkness in your life. Pray to walk in His light and reflect it to others.",
      "benediction": "May the light of Christ shine brightly through you, dispelling every shadow of darkness."
    },
    {
      "keywords": ["hope", "trust", "faith", "believe", "anchor", "promise"],
      "verses": ["Hebrews 6:19", "Romans 15:13", "Jeremiah 29:11", "Romans 5:5"],
      "themes": ["Hope in God", "Faith and trust", "His promises"],
      "callToWorship": "We have this hope as an anchor for our souls, firm and secure. Let us hold fast to the promises of God.",
      "prayerPoints": "Renew your hope in God's promises. Trust Him with the uncertainties of life.",
      "benediction": "May the God of hope fill you with all joy and peace as you trust in Him, overflowing with hope by the Holy Spirit."
    },
    {
      "keywords": ["name", "jesus", "savior", "lord", "christ", "messiah"],
      "verses": ["Philippians 2:9-11", "Acts 4:12", "John 14:6", "Romans 10:13"],
      "themes": ["The name of Jesus", "Salvation in Christ", "His lordship"],
      "callToWorship": "At the name of Jesus every knee shall bow. Let us exalt the name that is above every name.",
      "prayerPoints": "Thank God for the power in the name of Jesus. Pray that His name be glorified through your life.",
      "benediction": "May you go forth in the name of Jesus, carrying His authority and presence wherever you go."
    },
    {
      "keywords": ["forever", "eternal", "everlasting", "endless", "always"],
      "verses": ["Psalm 136:1", "Isaiah 40:8", "Hebrews 13:8", "Revelation 1:8"],
      "themes": ["God's eternal nature", "Everlasting love", "His unchanging character"],
      "callToWorship": "Jesus Christ is the same yesterday, today, and forever. His love endures through all generations.",
      "prayerPoints": "Thank God for His unchanging nature. Trust in His eternal promises that never fail.",
      "benediction": "May the eternal God be your refuge, and may His everlasting arms uphold you always."
    },
    {
      "keywords": ["prayer", "pray", "intercede", "petition", "ask", "seek"],
      "verses": ["Matthew 7:7-8", "Philippians 4:6", "1 Thessalonians 5:17", "James 5:16"],
      "themes": ["Power of prayer", "Communion with God", "Intercession"],
      "callToWorship": "Let us come boldly to the throne of grace, that we may obtain mercy and find grace to help in time of need.",
      "prayerPoints": "Commit to a deeper prayer life. Bring your needs and the needs of others before God.",
      "benediction": "May your prayer life flourish as you commune daily with the Father who hears and answers."
    },
    {
      "keywords": ["freedom", "free", "liberty", "chains", "captive", "deliver"],
      "verses": ["John 8:36", "Galatians 5:1", "2 Corinthians 3:17", "Isaiah 61:1"],
      "themes": ["Freedom in Christ", "Deliverance", "Breaking chains"],
      "callToWorship": "Where the Spirit of the Lord is, there is freedom. Let us celebrate the liberty we have in Christ.",
      "prayerPoints": "Thank God for freedom from sin and bondage. Pray for those who are still in chains.",
      "benediction": "May you walk in the glorious freedom of the children of God, never returning to bondage."
    },
    {
      "keywords": ["worship", "bow", "adore", "praise", "magnify", "exalt"],
      "verses": ["John 4:23-24", "Psalm 95:6-7", "Revelation 5:12-13", "Psalm 100:4"],
      "themes": ["True worship", "Adoration", "Honoring God"],
      "callToWorship": "Come, let us worship and bow down; let us kneel before the Lord our Maker, for He is our God.",
      "prayerPoints": "Examine your heart and offer pure worship. Ask God to make you a true worshiper in spirit and truth.",
      "benediction": "May your whole life be an act of worship, bringing glory to God in all that you do."
    },
    {
      "keywords": ["amazing", "wonder", "awesome", "marvelous", "great"],
      "verses": ["Psalm 139:14", "Psalm 77:14", "Deuteronomy 10:21", "Psalm 40:5"],
      "themes": ["God's wonders", "His awesome works", "Amazement at God"],
      "callToWorship": "Great is the Lord and greatly to be praised! His greatness is unsearchable, His wonders are without number.",
      "prayerPoints": "Reflect on the amazing works of God in your life. Let wonder and awe fill your worship.",
      "benediction": "May you never cease to be amazed by God's goodness, and may His wonders continually fill you with praise."
    }
  ]
}
